Merge pull request #21 from felesh-ai/fix/claan_up
Fix/claen up
